Revit 2024 API
AlphanumericRevisionSettings Properties
The AlphanumericRevisionSettings type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Prefix
 The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType.
Suffix
 The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType.
See Also
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace